%%%%%%%%%% EJERCICIO 1 %%%%%%%%%%

\begin{ejer}
    \textbf{Ejercicio 1. Hacer los cálculos correspondientes con el grafo que se ha mostrado más arriba.}
\end{ejer}

\begin{sagecommandline}
    sage: N = matrix(RDF,[[0, 0, 0, 0, 0.5 , 0.5, 0],[1/3, 0, 1/3, 0, 0, 1/3, 0],[0, 0, 0, 0.5, 0 , 0.5, 0],[0, 0, 0, 0, 0, 1, 0],[0.25, 0, 0, 0.25, 0, 0.25, 0.25],[0.5, 0.5, 0, 0, 0, 0, 0],[0, 0, 0, 0, 0 , 0, 0]])
\end{sagecommandline}

\begin{comment}
$N=\left(\begin{array}{rrrrrrr}
            0.0 & 0.0 & 0.0 & 0.0 & 0.5 & 0.5 & 0.0 \\
            0.3333333333333333 & 0.0 & 0.3333333333333333 & 0.0 & 0.0 & 0.3333333333333333 & 0.0 \\
            0.0 & 0.0 & 0.0 & 0.5 & 0.0 & 0.5 & 0.0 \\
            0.0 & 0.0 & 0.0 & 0.0 & 0.0 & 1.0 & 0.0 \\
            0.25 & 0.0 & 0.0 & 0.25 & 0.0 & 0.25 & 0.25 \\
            0.5 & 0.5 & 0.0 & 0.0 & 0.0 & 0.0 & 0.0 \\
            0.0 & 0.0 & 0.0 & 0.0 & 0.0 & 0.0 & 0.0 
        \end{array}
    \right)$
\end{comment}

$$N(x)= \sage{N}$$

\par\textbf{$1^{er}$ MÉTODO}

\begin{sagecommandline}
    sage: Q = matrix(RDF ,[[0, 0, 0, 0, 0.5 , 0.5, 0],[1/3, 0, 1/3, 0, 0, 1/3, 0],[0, 0, 0, 0.5, 0 , 0.5, 0],[0, 0, 0, 0, 0, 1, 0],[0.25, 0, 0, 0.25, 0, 0.25, 0.25],[0.5, 0.5, 0, 0, 0, 0, 0],[1/7, 1/7, 1/7, 1/7, 1/7, 1/7, 1/7]])
\end{sagecommandline}
\resizebox{\textwidth}{!}{$
    Q(x)= \sage{Q}
$}

\begin{sagecommandline}
    sage: A = matrix(RDF ,[[1/7, 1/7, 1/7, 1/7, 1/7, 1/7, 1/7],[1/7, 1/7, 1/7, 1/7, 1/7, 1/7, 1/7],[1/7, 1/7, 1/7, 1/7, 1/7, 1/7, 1/7],[1/7, 1/7, 1/7, 1/7, 1/7, 1/7, 1/7],[1/7, 1/7, 1/7, 1/7, 1/7, 1/7, 1/7],[1/7, 1/7, 1/7, 1/7, 1/7, 1/7, 1/7],[1/7, 1/7, 1/7, 1/7, 1/7, 1/7, 1/7]])
\end{sagecommandline} 
\resizebox{\textwidth}{!}{$
    A(x)= \sage{A}
$}

\begin{sagecommandline}
    sage: P=0.85*Q+0.15*A
\end{sagecommandline}
\resizebox{\textwidth}{!}{$
    P(x)= \sage{P}
$}

\begin{sagecommandline}
    sage: P_valores_propios = P.eigenvalues()
\end{sagecommandline}
\resizebox{\textwidth}{!}{$
    Valores propios: \sage{P_valores_propios}
$}

\begin{sagecommandline}
    sage: p=P.characteristic_polynomial()
\end{sagecommandline}
\resizebox{\textwidth}{!}{$
    p(x)= \sage{p}
$}

\begin{sagecommandline}
    sage: D = diagonal_matrix([P.eigenvalues()[0], P.eigenvalues()[1],P.eigenvalues()[2],P.eigenvalues()[3],P.eigenvalues()[4],P.eigenvalues()[5],P.eigenvalues()[6]])
\end{sagecommandline}
\resizebox{\textwidth}{!}{$
    D= \sage{D}
$}

\begin{sagecommandline}[\textwidth]
    sage: TODO1=P.eigenvectors_right()
\end{sagecommandline}
\resizebox{\textwidth}{!}{$
    TODO= \sage{TODO1}
$}

\begin{sagecommandline}[\textwidth]
    sage: P.eigenmatrix_right()[0]
    sage: P.eigenmatrix_right()[1]
\end{sagecommandline}
\resizebox{\textwidth}{!}{$
    TODO= \sage{P.eigenmatrix_right()[0]}
$}
\resizebox{\textwidth}{!}{$
    TODO= \sage{P.eigenmatrix_right()[1]}
$}
    
\begin{sagecommandline}
    sage: q1=(P.eigenvectors_right()[0])[1][0];
\end{sagecommandline}
\resizebox{\textwidth}{!}{$
    q1= \sage{q1}
$}

\begin{sagecommandline}
    sage: q2=(P.eigenvectors_right()[1])[1][0];
\end{sagecommandline}
\resizebox{\textwidth}{!}{$
    q2= \sage{q2}
$}

\begin{sagecommandline}
    sage: q3=(P.eigenvectors_right()[2])[1][0];
\end{sagecommandline}
\resizebox{\textwidth}{!}{$
    q3= \sage{q3}
$}

\begin{sagecommandline}
    sage: q4=(P.eigenvectors_right()[3])[1][0];
\end{sagecommandline}
\resizebox{\textwidth}{!}{$
    q4= \sage{q4}
$}

\begin{sagecommandline}
    sage: q5=(P.eigenvectors_right()[4])[1][0];
\end{sagecommandline}
\resizebox{\textwidth}{!}{$
    q5= \sage{q5}
$}

\begin{sagecommandline}
    sage: q6=(P.eigenvectors_right()[5])[1][0];
\end{sagecommandline}
\resizebox{\textwidth}{!}{$
    q6= \sage{q6}
$}

\begin{sagecommandline}
    sage: q7=(P.eigenvectors_right()[6])[1][0];
\end{sagecommandline}
\resizebox{\textwidth}{!}{$
    q7= \sage{q7}
$}

\begin{sagecommandline}
    sage: Q=column_matrix([q1,q2,q3,q4,q5,q6,q7]);
    sage: norm(P-Q*D*Q.inverse())<=10^(-10)
\end{sagecommandline}
\resizebox{\textwidth}{!}{$
    Q= \sage{Q}
$}
    
\begin{sagecommandline}
    sage: mo=matrix(RDF,[1, 0, 0, 0, 0, 0, 0])
    sage: mo*Q*D^100*Q.inverse()
\end{sagecommandline}
\resizebox{\textwidth}{!}{$
    \sage{mo*Q*D^100*Q.inverse()}
$}
    
\begin{sagecommandline}
    sage: z=(0.221980001405918,0.15271641500884678, 0.07125255257058884,0.08425917197181364, 0.12232440224893072,0.29349061966454393, 0.05397683712931336)
\end{sagecommandline}
\resizebox{\textwidth}{!}{$
    z= \sage{z}
$}
    
\begin{sagecommandline}
    sage: sum(z)
\end{sagecommandline}
    
\par\textbf{$2^{nd}$ MÉTODO}
    
\begin{sagecommandline}
    sage: G=P.transpose()
\end{sagecommandline}
\resizebox{\textwidth}{!}{$
    G(x)= \sage{G}
$}
    
\begin{sagecommandline}
    sage: G_valores_propios=G.eigenvalues()
\end{sagecommandline}
\resizebox{\textwidth}{!}{$
    Valores propios: \sage{G_valores_propios}
$}

\begin{sagecommandline}
    sage: p=G.characteristic_polynomial()
\end{sagecommandline}
\resizebox{\textwidth}{!}{$
    p(x)= \sage{p}
$}

\begin{sagecommandline}
    sage: G.eigenmatrix_right()[0]
\end{sagecommandline}
\resizebox{\textwidth}{!}{$
    \sage{G.eigenmatrix_right()[0]}
$}

\begin{sagecommandline}
    sage: G.eigenmatrix_right()[1]
\end{sagecommandline}
\resizebox{\textwidth}{!}{$
    \sage{G.eigenmatrix_right()[1]}
$}
    
\begin{sagecommandline}
    sage: e1=(G.eigenvectors_right()[0])[1][0];
\end{sagecommandline}
\resizebox{\textwidth}{!}{$
    e1= \sage{e1}
$}
    
\begin{sagecommandline}
    sage: sum(e1)
\end{sagecommandline}
    
\begin{sagecommandline}
    sage: SOL=1/(sum(e1))*e1
    sage: SOL
\end{sagecommandline}